model/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY updated_at DESC
---
def index
    @posts = Post.all.order('updated_at DESC')